[
    {
      "id": "1",
      "title": "Who will benefit from our oil?",
      "description": "From the publishers desk In July 2019, Kaieteur News conducted an extensive review of 130 oil contracts to better understand the extent to which the Guyana-ExxonMobil deal is fraught with unfair provisions. The findings were alarming. On a daily basis, Kaieteur News will expose these alarming provisions. Today, we start with the provision that speaks ",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2020/09/14/who-will-benefit-from-our-oil/",
      "image": null,
      "published": "2020-09-14 20:11:19.210464",
      "code": "gy"
    },
    {
      "id": "2",
      "title": "ExxonMobil says it put Payara FPSO on hold",
      "description": "ExxonMobil now claims that it has put on hold, the Payara project Floating Production, Storage, and Offloading (FPSO) vessel, called Prosperity. Work had recently started on the construction of the vessel, despite the fact that the Guyana government has not greenlit the project. In its recent press statement announcing the Redtail-1 discovery, Exxon noted, of ",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2020/09/14/exxonmobil-says-it-put-payara-fpso-on-hold/",
      "image": null,
      "published": "2020-09-14 20:11:19.230743",
      "code": "gy"
    },
    {
      "id": "3",
      "title": "ExxonMobil slapped with another lawsuit for climate change deception",
      "description": "By Kiana Wilburg The City of Charleston, South Carolina (SC), has slapped ExxonMobil and 23 other fossil fuel giants for their deception on climate change, the contributions of their operations to this global phenomenon, and the inherent costs to now deal with the consequences of increasing floods and rising temperatures in that American city. Other ",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2020/09/14/exxonmobil-slapped-with-another-lawsuit-for-climate-change-deception/",
      "image": null,
      "published": "2020-09-14 20:11:19.331436",
      "code": "gy"
    },
    {
      "id": "4",
      "title": "Murdered Berbice teens laid to rest",
      "description": "The murdered Berbice teens Joel, 19, and Isaiah Henry, 16, were yesterday laid to rest in a memorable, grand and primarily peaceful manner. A little over a week ago Guyana was rocked by the news that the butchered bodies of the teenagers were found dumped in clumps of bushes next to a coconut Estate in ",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2020/09/14/murdered-berbice-teens-laid-to-rest/",
      "image": null,
      "published": "2020-09-14 20:11:19.349145",
      "code": "gy"
    },
    {
      "id": "5",
      "title": "Attorney for five persons that were arrested and released says police on fishing expedition",
      "description": "Brutal slaying of the Henry boys While, the Guyana Police Force has gone silent on the status of the investigation into the brutal slaying of 16-year-old Isaiah Henry and his cousin 18-year-old Joel Henry of No. 3 Village, West Coast Berbice, a lawyer for some of the persons arrested has accused the police of going ",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2020/09/14/attorney-for-five-persons-that-were-arrested-and-released-says-police-on-fishing-expedition/",
      "image": null,
      "published": "2020-09-14 20:11:19.366568",
      "code": "gy"
    },
    {
      "id": "6",
      "title": "Bandit shoots man in retaliation after stumbling over fan",
      "description": "A bandit yesterday startled a family of four in their bedroom and shot the husband before escaping with cash and valuables. Wounded is Hardeo Seeram, 35, of Golden Grove, East Bank Demerara. The robbery and shooting incident took place at around 02:00Hrs at the familys home. According to Hardeos wife, she, their two daughters, ages ",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2020/09/14/bandit-shoots-man-in-retaliation-after-stumbling-over-fan/",
      "image": null,
      "published": "2020-09-14 20:11:19.492648",
      "code": "gy"
    },
    {
      "id": "7",
      "title": "Housing Ministry to reintroduce Turnkey home project",
      "description": "The Ministry of Housing and Water will embark on reintroducing the Turnkey Home Project that will see low-income families benefiting significantly. This was announced by the Minister within the Ministry, Susan Rodrigues on the NCN programme Budget 2020. The Minister also announced that with reintroducing the project, the beneficiaries will now be able to choose ",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2020/09/14/housing-ministry-to-reintroduce-turnkey-home-project/",
      "image": null,
      "published": "2020-09-14 20:11:19.533636",
      "code": "gy"
    },
    {
      "id": "10",
      "title": "Four arrested for Bath businessmans murder",
      "description": "Sources close to the investigations of the murder of Experiment, Bath Settlement West Coast Berbice businessman, Mohomed Raymond Haniff disclosed that four persons were arrested in connection with his murder. Haniff was chopped to his head and neck Saturday night after three masked men invaded his premises. Currently the wife of Haniff and four suspects ",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2020/09/14/four-arrested-for-bath-businessmans-murder/",
      "image": null,
      "published": "2020-09-14 20:11:19.644183",
      "code": "gy"
    },
    {
      "id": "11",
      "title": "Tailor shot in the foot during suspected armed robbery",
      "description": "A tailor from Onderneeming Sandpit on the Essequibo Coast was shot in the foot Saturday night during an attempted armed robbery. Based on information reaching Kaieteur News, the 39-year-old man, Narindra Persaud, was on his veranda with his wife at the time of the robbery. The man said that sometime around 19:45 hrs two masked ",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2020/09/14/tailor-shot-in-the-foot-during-suspected-armed-robbery/",
      "image": null,
      "published": "2020-09-14 20:11:19.669839",
      "code": "gy"
    },
    {
      "id": "12",
      "title": "Stagnant infrastructural projects to be completed with speed and diligence Edghill",
      "description": "With $34.4 billion budgeted for the Public Works Ministry for 2020, the new Peoples Progressive Party Civic (PPP/C) administration plans to complete a number of transformational projects that were left stagnant by the previous A Partnership For National Unity + Alliance For Change (APNU+AFC) government. Public Works Minister, Juan Edghill during his 2020 budget speech ",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2020/09/14/stagnant-infrastructural-projects-to-be-completed-with-speed-and-diligence-edghill/",
      "image": null,
      "published": "2020-09-14 20:11:19.734268",
      "code": "gy"
    }
  ]